.emacs.d/emacs.org
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el
* Emacs Application Setup
** Startup Direction
#+begin_src emacs-lisp

      ;;(setenv "PATH" (concat (getenv "PATH") ":/opt/homebrew/bin"))
      ;;(setq exec-path (append exec-path '("/opt/homebrew/bin")))

      ;; Check if `exec-path-from-shell` is not already installed
    ;(unless (package-installed-p 'exec-path-from-shell)
      ;; Refresh package databases
     ; (package-refresh-contents)
      ;; Install `exec-path-from-shell`
      ;(package-install 'exec-path-from-shell))

    ;; Initialize `exec-path-from-shell` after installation
    ;(when (memq window-system '(mac ns x))
     ; (exec-path-from-shell-initialize))
  (use-package exec-path-from-shell
    :ensure t
    :config
    (when (memq window-system '(mac ns x))
      (exec-path-from-shell-initialize)))

#+end_src
** Package configuration

#+begin_src emacs-lisp
	       ;;; -*- lexical-binding: t -*- 


    ;; Initialize package sources
    (require 'package)

    (setq package-archives '(("melpa" . "https://melpa.org/packages/")
			     ("org" . "https://orgmode.org/elpa/")
			     ("elpa" . "https://elpa.gnu.org/packages/")))

    (package-initialize)

    (unless package-archive-contents
      (package-refresh-contents))
    (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (require 'use-package)
  (setq
   use-package-always-ensure t ;; Makes sure to download new packages if they aren't already downloaded
   use-package-verbose t) ;; Package install logging. Packages break, it's nice to know why.

    ;; Initialize use-package on non-Linux platforms
    (unless (package-installed-p 'use-package)
      (package-install 'use-package))

    (setq use-package-always-ensure t)
  (use-package exec-path-from-shell
  :config
  (exec-path-from-shell-initialize))

#+end_src

** File Management
*** Emacs Custom Variables

#+begin_src emacs-lisp
  
  ; sending custom files to shadow realm
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file))

#+end_src

*** Keeping Emacs Clean 

#+begin_src emacs-lisp

  ;; For backup files (filename~)
  (setq backup-directory-alist
	`(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))

  ;; For autosave files (#filename#)
  ;; Might be useless now with no-littering package
  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory))
  (setq auto-save-file-name-transforms
	`((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

  ; NO LITTERING
  (use-package no-littering)

#+end_src

** Basic UI

#+begin_src emacs-lisp
  (setq visible-bell t)


					  ; Font
  (set-face-attribute 'default nil :font "Iosevka" :height 280)

  (use-package all-the-icons
    :if (display-graphic-p))

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

  (use-package doom-themes)
  (load-theme 'doom-gruvbox)

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :config
    (setq doom-modeline-icon (display-graphic-p)))

  (use-package which-key ; should be moved
    :init (which-key-mode)
    :config
    (setq which-key-idle-delay 0.3))

  (use-package general) ; should be moved maybe

  (defun mr-x/general-setup ()
    (display-line-numbers-mode 1)
    (set-frame-parameter (selected-frame) 'alpha '(80 50)))

  (add-hook 'text-mode-hook #'mr-x/general-setup)
  (add-hook 'prog-mode-hook #'mr-x/general-setup)

					  ; opacity
  (set-frame-parameter (selected-frame) 'alpha '(80 50))
  (add-to-list 'default-frame-alist '(alpha-background . 20))
					  ; keybindings section
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit) ; Make ESC quit prompts
  (global-set-key (kbd "C-c l") #'org-store-link) ; Suggested Key-binding from org-manual
  (global-set-key (kbd "C-c a") #'org-agenda) ; Suggested Key-binding from org-manual
  (global-set-key (kbd "C-c c") #'org-capture) ; Suggested Key-binding from org-manual



  (setq inhibit-startup-message t) ; Disable the startup message
  (scroll-bar-mode -1) ; Disable the visible scrollbar
  (tool-bar-mode -1)   ; Disable the toolbar
  (tooltip-mode -1)    ; Disable tooltips
  (menu-bar-mode -1)   ; Disable the menu bar
  (set-fringe-mode 10) ; Give some breathing room

#+end_src
** UX
*** Beacon
#+begin_src emacs-lisp

  (use-package beacon
    :init
    (beacon-mode)
    :config
    (setq beacon-blink-when-window-scrolls t
	  beacon-blink-when-window-changes t))

#+end_src

*** Scrolling

#+begin_src emacs-lisp
  (use-package smooth-scrolling
    :ensure t
    :config
    (smooth-scrolling-mode 1)
    (setq smooth-scroll-margin 3))
#+end_src

**** I'm a winner

#+begin_src emacs-lisp
  (require 'winner)
(winner-mode 1)
#+end_src
*** Company
#+begin_src emacs-lisp

    (use-package company
      :ensure t
      :after lsp-mode
      :hook (lsp-mode . company-mode)
      :bind (:map company-active-map
		  ("<tab>" . company-complete-selection))
      (:map lsp-mode-map
	    ("<tab>" . company-indent-or-complete-common))
      :custom
      (company-minimum-prefix-length 1)    ;; Minimum prefix length for completion
      (company-idle-delay 0.0)           ;; Delay before completion starts
      (global-company-mode))


    ;; Flycheck is the newer version of flymake and is needed to make lsp-mode not freak out.
  (use-package flycheck
    :config
    (add-hook 'prog-mode-hook 'flycheck-mode) ;; always lint my code
    (add-hook 'after-init-hook #'global-flycheck-mode))

    (use-package company-box
      :hook (company-mode . company-box-mode))




#+end_src
*** PDFView
#+begin_src emacs-lisp
  (defun mr-x/PDFviewSetup()
    "preparation function for PDFView"

  (global-display-line-numbers-mode nil)
  (display-line-numbers-mode -1) 
  (set-frame-parameter (selected-frame) 'alpha '(100 50)))


  (add-hook 'pdf-view-mode-hook #'mr-x/PDFviewSetup)


#+end_src
*** More UI Enhancements
#+begin_src emacs-lisp
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode))
  
  (fset 'yes-or-no-p 'y-or-n-p)
#+end_src
** Emacs Lisp Formatter
#+begin_src emacs-lisp
  (use-package elisp-autofmt
    :commands (elisp-autofmt-mode elisp-autofmt-buffer)
    :hook (emacs-lisp-mode . elisp-autofmt-mode))
#+end_src

** Scratch Buffer Setup

#+begin_src emacs-lisp
  
  (setq initial-major-mode 'org-mode)
  (setq initial-scratch-message "\
  # This is a scratch org buffer.")
 

#+end_src

* Helpful

#+begin_src emacs-lisp
  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable))

  (global-set-key (kbd "C-h v") #'helpful-variable)
  (global-set-key (kbd "C-h k") #'helpful-key)
  (global-set-key (kbd "C-h x") #'helpful-command)

#+end_src

* Source Control
** Magit
#+begin_src emacs-lisp
  (use-package magit
    :ensure t)
  (setq magit-view-git-manual-method 'man)
#+end_src

* Evil

#+begin_src emacs-lisp
    (use-package evil
      :init (setq evil-want-integration t)
     (setq evil-want-keybinding nil)
      (setq evil-want-C-u-scroll t)
      (setq evil-want-C-i-jump nil)
      (setq evil-respect-visual-line-mode t)
      :config
      (evil-mode 1))

    (use-package evil-collection
      :after evil
      :config
      (evil-collection-init))
  
  (use-package evil-org
    :ensure t
    :after org
    :hook (org-mode . (lambda () evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))


#+end_src

