.emacs.d/init.el

(use-package dired
      :ensure nil
      :commands (dired dired-jump)
      :bind (("C-x C-j" . dired-jump))
      :custom
      (setq insert-directory-program "gls" dired-use-ls-dired t)
      (setq dired-listing-switches "-al --group-directories-first")
      :config
      (evil-collection-define-key 'normal 'dired-mode-map
	"h" 'dired-up-directory
	"l" 'dired-find-file))


    (defun my-dired-init ()
    "Bunch of stuff to run for dired, either immediately or when it's
     loaded."
    ;; <add other stuff here>
    (define-key dired-mode-map [remap dired-find-file]
      'dired-single-buffer)
    (define-key dired-mode-map [remap dired-mouse-find-file-other-window]
      'dired-single-buffer-mouse)
    (define-key dired-mode-map [remap dired-up-directory]
      'dired-single-up-directory))

 ; dired-single-magic-buffer
  (global-set-key [(f5)] 'dired-single-magic-buffer)
(global-set-key [(control f5)] (function
	(lambda nil (interactive)
	(dired-single-magic-buffer default-directory))))
(global-set-key [(shift f5)] (function
	(lambda nil (interactive)
	(message "Current directory is: %s" default-directory))))
(global-set-key [(meta f5)] 'dired-single-toggle-buffer-name)

  ;; if dired's already loaded, then the keymap will be bound
  (if (boundp 'dired-mode-map)
      ;; we're good to go; just add our bindings
      (my-dired-init)
    ;; it's not loaded yet, so add our bindings to the load-hook
    (add-hook 'dired-load-hook 'my-dired-init))




    (use-package all-the-icons-dired
      :hook (dired-mode . all-the-icons-dired-mode))

    (use-package dired-hide-dotfiles
      :hook (dired-mode . dired-hide-dotfiles-mode)
      :config
      (evil-collection-define-key 'normal 'dired-mode-map
	"H" 'dired-hide-dotfiles-mode))

; Ivy & Counsel
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
	 :map ivy-minibuffer-map
	 ("TAB" . ivy-alt-done)
	 ("C-l" . ivy-alt-done)
	 ("C-j" . ivy-next-line)
	 ("C-k" . ivy-previous-line)
	 :map ivy-switch-buffer-map
	 ("C-k" . ivy-previous-line)
	 ("C-l" . ivy-done)
	 ("C-d" . ivy-switch-buffer-kill)
	 :map ivy-reverse-i-search-map
	 ("C-k" . ivy-previous-line)
	 ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) "))

(use-package ivy-rich
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :config
  (counsel-mode 1))

(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x C-f") 'counsel-find-file)

(use-package counsel-dash)

(use-package perspective
:bind
("C-x C-b" . persp-counsel-switch-buffer)         ; or use a nicer switcher, see below
:custom
(persp-mode-prefix-key (kbd "C-x M-x"))  ; pick your own prefix key here
:init
(persp-mode))

(defun mr-x/org-mode-setup()

  (visual-line-mode 1)
  (auto-fill-mode 0)
  (setq org-agenda-include-diary t)
  (setq evil-auto-indent nil))

(setq org-agenda-files '("~/roaming/agenda.org"))

; Animation support

(add-hook 'org-mode-hook #'org-inline-anim-mode)

(use-package org
    :hook (org-mode . mr-x/org-mode-setup)
    :config
    (setq org-hide-emphasis-markers t)
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    (setq org-highlight-latex-and-related '(latex))

    ; org- habit setup

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)

    (setq org-todo-keywords
	  '((sequence
	     "TODO(t)"
	     "NEXT(n)"
	     "|"
	     "DONE(d!)")
	    (sequence
	     "BACKLOG(b)"
	     "PLAN(p)"
	     "READY(r)"
	     "IN-PROGRESS(i)"
	     "REVIEW(v)"
	     "WAIT(w@/!)"
	     "HOLD(h)"
	     "|"
	     "COMPLETED(c)"
	     "CANC(k@)")))

    (setq org-todo-keyword-faces
	  '(("TODO" . "#FF1800")
	    ("NEXT" . "#FF1800")
	    ("PLAN" . "#F67F2F")
	    ("DONE" . "#62656A")
	    ("HOLD" . "#62656A")
	    ("WAIT" . "#B7CBA8")
	    ("IN-PROGRESS" . "#b7cba8") 
	    ("BACKLOG" . "#62656A")))

    (custom-set-faces
     '(org-level-1 ((t (:foreground "#ff743f")))))

    (custom-set-faces
     '(org-level-2 ((t (:foreground "#67bc44")))))

    (custom-set-faces
     '(org-level-3 ((t (:foreground "#67c0de")))))

    (setq org-refile-targets
	  '(("Archive.org" :maxlevel . 1)))

    (advice-add 'org-refile :after 'org-save-all-org-buffers))

(require 'org-bullets)
(setq org-bullets-face-name (quote org-bullet-face))
(setq org-bullets-bullet-list '("🃏" "⡂" "⡆" "⢴" "✸" "☯" "✿" "☯" "✜" "☯" "◆" "☯" "▶"))
(setq org-ellipsis " ‧")

(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))

(setq-default prettify-symbols-alist '(("#+BEGIN_SRC" . "†")
				       ("#+END_SRC" . "†")
				       ("#+begin_src" . "†")
				       ("#+end_src" . "†")
				       ("#+BEGIN_LaTeX" . "†")
				       ("#+END_LaTeX" . "†")
				       (">=" . "≥")
				       ("=>" . "⇨")))
(setq prettify-symbols-unprettify-at-point 'right-edge)
(add-hook 'org-mode-hook 'prettify-symbols-mode)

(use-package org-timeblock)

(setq org-agenda-skip-scheduled-if-done t
      org-agenda-skip-deadline-if-done t
      org-agenda-include-deadlines t
      org-agenda-block-separator #x2501
      org-agenda-compact-blocks t
      org-agenda-start-with-log-mode t)

(setq org-agenda-clockreport-parameter-plist
      (quote (:link t :maxlevel 5 :fileskip0 t :compact t :narrow 80)))
(setq org-agenda-deadline-faces
      '((1.0001 . org-warning)              ; due yesterday or before
	(0.0    . org-upcoming-deadline)))  ; due today or later

(defun org-habit-streak-count ()
(goto-char (point-min))
(while (not (eobp))
  ;;on habit line?
  (when (get-text-property (point) 'org-habit-p)
    (let ((streak 0)
	  (counter (+ org-habit-graph-column (- org-habit-preceding-days org-habit-following-days)))
	  )
      (move-to-column counter)
      ;;until end of line
      (while (= (char-after (point)) org-habit-completed-glyph)
	      (setq streak (+ streak 1))
	      (setq counter (- counter 1))
	      (backward-char 1))
      (end-of-line)
      (insert (number-to-string streak))))
  (forward-line 1)))

(add-hook 'org-agenda-finalize-hook 'org-habit-streak-count)

(defun my/style-org-agenda()
  (set-face-attribute 'org-agenda-date nil :height 1.1)
  (set-face-attribute 'org-agenda-date-today nil :height 1.1 :slant 'italic)
  (set-face-attribute 'org-agenda-date-weekend nil :height 1.1))

(add-hook 'org-agenda-mode-hook 'my/style-org-agenda)

(setq org-agenda-breadcrumbs-separator " ❱ "
      org-agenda-current-time-string "⏰ ┈┈┈┈┈┈┈┈┈┈┈ now"
      org-agenda-time-grid '((weekly today require-timed)
			     (800 1000 1200 1400 1600 1800 2000)
			     "---" "┈┈┈┈┈┈┈┈┈┈┈┈┈")
      org-agenda-prefix-format '((agenda . "%i %-12:c%?-12t%b% s")
				 (todo . " %i %-12:c")
				 (tags . " %i %-12:c")
				 (search . " %i %-12:c")))

(setq org-agenda-format-date (lambda (date) (concat "\n" (make-string (window-width) 9472)
						    "\n"
						    (org-agenda-format-date-aligned date))))
(setq org-cycle-separator-lines 2)

; Org-babel
