.emacs.d/emacs.org
** Org Babel

#+begin_src emacs-lisp


      (org-babel-do-load-languages
       'org-babel-load-languages
       '((emacs-lisp . t)
	 (js . t)
	 (typescript . t)
	 (latex . t)
	 (python . t)))

  (setq org-babel-python-command "python3")


      ; structure templates
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("C" . "comment"))
  (add-to-list 'org-structure-template-alist '("js" . "src javascript"))
  (add-to-list 'org-structure-template-alist '("l" . "export latex"))




#+end_src

** Org Babel Auto Tangle
#+begin_src emacs-lisp

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun efs/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
			(expand-file-name "~/.emacs.d/emacs.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
	(org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

#+end_src

** Org Roam

#+begin_src emacs-lisp
  (use-package org-roam
    :ensure t
    :demand t
    :custom
    (org-roam-directory "~/roaming/notes/")
    (org-roam-completion-everywhere t)
    (org-roam-capture-templates
     '(("d" "default" plain
	"%?"
	:if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n+date: %U\n")
	:unnarrowed t)
       ("w" "workout" plain
	"%?"
	:if-new (file+head "workouts/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
	:unnarrowed t)
       ("l" "programming language" plain
	"* Characteristics\n\n- Family: %?\n- Inspired by: \n\n* Reference:\n\n"
	:if-new (file+head "code-notes/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
	:unnarrowed t)
       ("b" "book notes" plain
	(file "~/roaming/Templates/BookNoteTemplate.org")
	:if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
	:unnarrowed t)
       ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
	:if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags:project")
	:unnarrowed t)))
    (org-roam-dailies-capture-templates
     '(("d" "default" entry "* %<%I:%M %p>: %?"
	:if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
    :bind (("C-c n l" . org-roam-buffer-toggle)
	   ("C-c n f" . org-roam-node-find)
	   ("C-c n i" . org-roam-node-insert)
	   ("C-c n I" . org-roam-node-insert-immediate)
					  ; ("C-c n p" . my/org-roam-find-project)
					  ;("C-c n t" . my/org-roam-capture-task)
					  ; ("C-c n b" . my/org-roam-capture-inbox)
	   :map org-mode-map
	   ("C-M-i"   . completion-at-point)
	   :map org-roam-dailies-map
	   ("Y" . org-roam-dailies-capture-yesterday)
	   ("T" . org-roam-dailies-capture-tomorrow))
    :bind-keymap
    ("C-c n d" . org-roam-dailies-map)
    :config
    (require 'org-roam-dailies)
    (org-roam-db-autosync-mode))
  (setq org-roam-dailies-directory "journal/")

  ;; Bind this to C-c n I
  (defun org-roam-node-insert-immediate (arg &rest args)
    (interactive "P")
    (let ((args (cons arg args))
	  (org-roam-capture-templates (list (append (car org-roam-capture-templates)
						    '(:immediate-finish t)))))
      (apply #'org-roam-node-insert args)))
#+end_src

* Development
** Projectile
#+begin_src emacs-lisp
  (use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/code/projects")
    (setq projectile-project-search-path '("~/code/projects")))
  (setq projectile-switch-project-action #'projectile-dired))

#+end_src

** Devdocs

#+begin_src emacs-lisp
(use-package devdocs)
#+end_src
** Languages
*** All Languages (experimental)
#+begin_src emacs-lisp
(electric-pair-mode 1)
#+end_src>
*** Latex
#+begin_src emacs-lisp
  (setq org-format-latex-options (plist-put org-format-latex-options :scale 3.0))

#+end_src
*** TypeScript/Javascript
#+begin_src emacs-lisp
  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2))

#+end_src

*** HTML & CSS
#+begin_src emacs-lisp

  ;; emmet mode
(require 'emmet-mode)
(use-package emmet-mode
  :ensure t
  :config
  (add-hook 'web-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
  (add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.

;; web mode
(require 'web-mode)
(add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.php\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.scss\\'" . web-mode))
(add-to-list 'auto-mode-alist '("\\.css\\'" . web-mode))

(defun my-web-mode-hook ()
  "Hooks for Web mode."
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (setq web-mode-code-indent-offset 2)
)
(add-hook 'web-mode-hook  'my-web-mode-hook)

#+end_src
*** Python
#+begin_src emacs-lisp
  (use-package lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))  ; or lsp-deferred

#+end_src
** Language Servers

#+begin_src emacs-lisp
      (use-package lsp-mode
	:commands (lsp lsp-deferred)
	:init
	(setq lsp-keymap-prefix "C-l")
	:config
	(lsp-enable-which-key-integration t))

#+end_src

* AI Overlord / Wifey
#+begin_src emacs-lisp
  (load "~/.emacs_secrets.el")
  (setq-default gptel-model "gpt-4"
		gptel-api-key (getenv "GPT_API_KEY")
		gptel-default-mode 'org-mode)

  (add-hook 'gptel-post-response-functions 'gptel-end-of-response)

#+end_src

* Other Configs (to be separated)

#+begin_src emacs-lisp
    (defun efs/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
	  visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . efs/org-mode-visual-fill))

  (recentf-mode 1) ; Recent files
  (setq recentf-max-menu-items 25)
  (global-set-key (kbd "s-r") #'recentf-open)
  (ido-mode 1) ; IDO mode for navigating files and buffers

  (column-number-mode)
  (global-display-line-numbers-mode t)
  (setq display-line-numbers-type 'relative) 
  (global-display-line-numbers-mode)
  (dolist (mode '(text-mode-hook prog-mode-hook conf-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))
  (dolist (mode '(org-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))

#+end_src

* Productivity
** Diary
#+begin_src emacs-lisp

  (setq diary-file "~/life/diary-entries/main-diary.org")
  
#+end_src
** WAKATIME

#+begin_src emacs-lisp

  (load "~/.emacs_secrets.el")
  (use-package wakatime-mode)
  (setq wakatime-api-key (getenv "WAKATIME_API_KEY"))
  (setq wakatime-cli-path "/opt/homebrew/bin/wakatime-cli")
  (global-wakatime-mode)

#+end_src

** mu4e
#+begin_src emacs-lisp

  (use-package mu4e
    :ensure nil
    :defer 20
    :config
    (add-to-list 'load-path "/opt/homebrew/Cellar/mu/1.12.1/share/emacs/site-lisp/mu/mu4e")
    (setq mu4e-mu-binary "/opt/homebrew/bin/mu")


    (setq mu4e-change-filenames-when-moving t)

    (setq mu4e-update-interval (* 10 60))
    (setq mu4e-get-mail-command "mbsync -a")
    (setq mu4e-maildir "~/Maildir")

    (setq mu4e-drafts-folder "/[Gmail].Drafts")
    (setq mu4e-sent-folder "/[Gmail].Sent Mail")
    (setq mu4e-refile-folder "/[Gmail].All Mail")
    (setq mu4e-trash-folder "/[Gmail].Trash")

    (setq mu4e-maildir-shortcuts
	  '(("/Inbox"             . ?i)
	    ("/[Gmail].Sent Mail" . ?s)
	    ("/[Gmail].Trash"     . ?t)
	    ("/[Gmail].Drafts"    . ?d)
	    ("/[Gmail].All Mail"  . ?a))))

  (add-hook 'after-init-hook (lambda ()
			       (message "Emacs is ready! This is your test after-init hook!")
			       ))



#+end_src

* Misc
** Let's chat baby

#+begin_src emacs-lisp
  (setq erc-server "irc.libera.chat"
	erc-nick "MrX"    ; 
	erc-track-shorten-start 8
	erc-autojoin-channels-alist '(("irc.libera.chat" "#systemcrafters" "#emacs"))
	erc-kill-buffer-on-part t
	      erc-auto-query 'bury)


  
#+end_src
